# Introduction to Pandas

In [22]:
from pprint import pprint

import numpy as np
import pandas as pd

## DataFrames

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia', 2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [3]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [25]:
data = [
    {
        'Engine Cylinders': 4,
        'Engine HP': 138.0,
        'MSRP': 2000,
        'Make': 'Nissan',
        'Model': 'Stanza',
        'Transmission Type': 'MANUAL',
        'Vehicle_Style': 'sedan',
        'Year': 1991
    },
    {
        'Engine Cylinders': 4,
        'Engine HP': None,
        'MSRP': 27150,
        'Make': 'Hyundai',
        'Model': 'Sonata',
        'Transmission Type': 'AUTOMATIC',
        'Vehicle_Style': 'Sedan',
        'Year': 2017
    },
    {
        'Engine Cylinders': 4,
        'Engine HP': 218.0,
        'MSRP': 54990,
        'Make': 'Lotus',
        'Model': 'Elise',
        'Transmission Type': 'MANUAL',
        'Vehicle_Style': 'convertible',
        'Year': 2010
    },
    {
        'Engine Cylinders': 4,
        'Engine HP': 194.0,
        'MSRP': 34450,
        'Make': 'GMC',
        'Model': 'Acadia',
        'Transmission Type': 'AUTOMATIC',
        'Vehicle_Style': '4dr SUV',
        'Year': 2017
    },
    {
        'Engine Cylinders': 6,
        'Engine HP': 261.0,
        'MSRP': 32340,
        'Make': 'Nissan',
        'Model': 'Frontier',
        'Transmission Type': 'MANUAL',
        'Vehicle_Style': 'Pickup',
        'Year': 2017
    }
]

In [27]:
df = pd.DataFrame(data)
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

In [28]:
df.head(2)

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017

## Series

In [29]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [30]:
df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [31]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [34]:
df[['Make', 'Model', 'MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [35]:
df['id'] = [1, 2, 3, 4, 5]
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year,id
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991,1
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017,2
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010,3
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017,4
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017,5

In [36]:
df['id']

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [37]:
df['id'] = [10, 20, 30, 40, 50]
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year,id
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991,10
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017,20
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010,30
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017,40
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017,50

In [38]:
del df['id']
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

## Accessing elements

In [39]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
df.loc[1]

Engine Cylinders             4
Engine HP                  NaN
MSRP                     27150
Make                   Hyundai
Model                   Sonata
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
Year                      2017
Name: 1, dtype: object

In [41]:
df.loc[[1, 2]]

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010

In [42]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [43]:
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
a,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
b,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
c,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
d,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017
e,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

In [45]:
df.loc[['b', 'c']]

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
b,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
c,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010

In [46]:
df.iloc[1]

Engine Cylinders             4
Engine HP                  NaN
MSRP                     27150
Make                   Hyundai
Model                   Sonata
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
Year                      2017
Name: b, dtype: object

In [47]:
df.iloc[[1, 2, 4]]

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
b,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
c,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
e,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

In [54]:
df = df.reset_index(drop=True)
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

## Element-wise operations

In [55]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [56]:
df['Engine HP'] / 100

0    1.38
1     NaN
2    2.18
3    1.94
4    2.61
Name: Engine HP, dtype: float64

In [57]:
df['Engine HP'] * 2

0    276.0
1      NaN
2    436.0
3    388.0
4    522.0
Name: Engine HP, dtype: float64

## Filtering

In [58]:
df['Year']

0    1991
1    2017
2    2010
3    2017
4    2017
Name: Year, dtype: int64

In [59]:
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [60]:
df[df['Year'] >= 2015]

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,Sedan,2017
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr SUV,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

In [61]:
df[df['Make'] == 'Nissan']

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

In [63]:
df[(df['Make'] == 'Nissan') & (df['Year'] >= 2015)]

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
4,6,261.0,32340,Nissan,Frontier,MANUAL,Pickup,2017

## String operations

In [64]:
df['Vehicle_Style']

0          sedan
1          Sedan
2    convertible
3        4dr SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [65]:
df['Vehicle_Style'].str.lower()

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle_Style, dtype: object

In [66]:
df['Vehicle_Style'].str.replace(' ', '_')

0          sedan
1          Sedan
2    convertible
3        4dr_SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [69]:
df['Vehicle_Style'].str.replace(' ', '_').str.lower()

0          sedan
1          sedan
2    convertible
3        4dr_suv
4         pickup
Name: Vehicle_Style, dtype: object

In [70]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.replace(' ', '_').str.lower()
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr_suv,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,pickup,2017

## Summarizing operations

In [71]:
df['MSRP'].min()

2000

In [72]:
df['MSRP'].max()

54990

In [73]:
df['MSRP'].mean()

30186.0

In [74]:
df['MSRP'].describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [76]:
df.describe().round(2)

       Engine Cylinders  Engine HP      MSRP     Year
count              5.00       4.00      5.00     5.00
mean               4.40     202.75  30186.00  2010.40
std                0.89      51.30  18985.04    11.26
min                4.00     138.00   2000.00  1991.00
25%                4.00     180.00  27150.00  2010.00
50%                4.00     206.00  32340.00  2017.00
75%                4.00     228.75  34450.00  2017.00
max                6.00     261.00  54990.00  2017.00

In [77]:
df['Make'].unique()

array(['Nissan', 'Hyundai', 'Lotus', 'GMC'], dtype=object)

In [78]:
df['Make'].nunique()

4

In [79]:
df.nunique()

Engine Cylinders     2
Engine HP            4
MSRP                 5
Make                 4
Model                5
Transmission Type    2
Vehicle_Style        4
Year                 3
dtype: int64

## Missing values

In [85]:
df.isna().sum()

Engine Cylinders     0
Engine HP            1
MSRP                 0
Make                 0
Model                0
Transmission Type    0
Vehicle_Style        0
Year                 0
dtype: int64

In [83]:
df.isnull()

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,False,False,False,False,False,False,False,False
1,False,True,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [84]:
df.isnull().sum()

Engine Cylinders     0
Engine HP            1
MSRP                 0
Make                 0
Model                0
Transmission Type    0
Vehicle_Style        0
Year                 0
dtype: int64

## Grouping

```
SELECT
    transmission_type,
    AVG(MSRP)
FROM
    cars
GROUP By
    transmission_type
```

In [87]:
df.groupby('Transmission Type')['MSRP'].mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

In [88]:
df.groupby('Transmission Type')['MSRP'].min()

Transmission Type
AUTOMATIC    27150
MANUAL        2000
Name: MSRP, dtype: int64

In [89]:
df.groupby('Transmission Type')['MSRP'].max()

Transmission Type
AUTOMATIC    34450
MANUAL       54990
Name: MSRP, dtype: int64

## Getting the NumPy arrays

In [90]:
df['MSRP']

0     2000
1    27150
2    54990
3    34450
4    32340
Name: MSRP, dtype: int64

In [91]:
df['MSRP'].values

array([ 2000, 27150, 54990, 34450, 32340])

In [92]:
df

,Engine Cylinders,Engine HP,MSRP,Make,Model,Transmission Type,Vehicle_Style,Year
0,4,138.0,2000,Nissan,Stanza,MANUAL,sedan,1991
1,4,NaN,27150,Hyundai,Sonata,AUTOMATIC,sedan,2017
2,4,218.0,54990,Lotus,Elise,MANUAL,convertible,2010
3,4,194.0,34450,GMC,Acadia,AUTOMATIC,4dr_suv,2017
4,6,261.0,32340,Nissan,Frontier,MANUAL,pickup,2017

## Exporting dataframe to dict

In [93]:
df.to_dict(orient='records')

[{'Engine Cylinders': 4,
  'Engine HP': 138.0,
  'MSRP': 2000,
  'Make': 'Nissan',
  'Model': 'Stanza',
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'Year': 1991},
 {'Engine Cylinders': 4,
  'Engine HP': nan,
  'MSRP': 27150,
  'Make': 'Hyundai',
  'Model': 'Sonata',
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'sedan',
  'Year': 2017},
 {'Engine Cylinders': 4,
  'Engine HP': 218.0,
  'MSRP': 54990,
  'Make': 'Lotus',
  'Model': 'Elise',
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'Year': 2010},
 {'Engine Cylinders': 4,
  'Engine HP': 194.0,
  'MSRP': 34450,
  'Make': 'GMC',
  'Model': 'Acadia',
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'Year': 2017},
 {'Engine Cylinders': 6,
  'Engine HP': 261.0,
  'MSRP': 32340,
  'Make': 'Nissan',
  'Model': 'Frontier',
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'pickup',
  'Year': 2017}]